trade_exp/src/InformationRegisters/СтоимостьДоставкиПоЗонам/СтоимостьДоставкиПоЗонам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="04365a5f-dbee-4cc9-8016-fd62e5a5668c">
  <name>СтоимостьДоставкиПоЗонам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="739920b6-45aa-4908-9007-91e9161057e1">
    <name>СтоимостьДляВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="17627933-0e80-46f6-a773-4b73250d4deb">
    <name>МинимальнаяСтоимость</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="a246d299-18dd-4335-b2e7-341fe647d335">
    <name>СтоимостьДляКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="d757bb38-0f12-4aa9-895e-f03e8e33eb7c">
    <name>ЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b390139b-5806-49e2-ac4b-ff8c41c466c4">
    <name>Тариф</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="72cf1185-3d87-46d3-a65f-5a69b3f4264a">
    <name>Филиал</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/СтоимостьДоставкиПоЗонам/Forms/ФормаЗагрузки/Module.bsl
&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры
&НаСервере
Процедура ЗагрузитьНаСервере()
	НомерСтроки = 2;
	ЦветОшибка= Новый Цвет(255,0,0);
	ЦветБелый= Новый Цвет(255, 255, 255);
	
	Пока Истина Цикл
		Ошибка= Ложь;
		стрНомерСтроки= Формат(НомерСтроки, "ЧРГ=; ЧГ=0");
		
		//Читаем данные
		стрЗонаДоставки= СокрЛП(ТабличныйДокумент.Область("R"+стрНомерСтроки+"C1").Текст);
		Если ПустаяСтрока(стрЗонаДоставки) Тогда 
			Прервать;
		КонецЕсли;
		стрТариф= СокрЛП(ТабличныйДокумент.Область("R"+стрНомерСтроки+"C2").Текст);
		стрФилиал= СокрЛП(ТабличныйДокумент.Область("R"+стрНомерСтроки+"C3").Текст);    
		стрПериод= СокрЛП(ТабличныйДокумент.Область("R"+стрНомерСтроки+"C4").Текст);
		стрСтоимостьДляВодителя= СокрЛП(ТабличныйДокумент.Область("R"+стрНомерСтроки+"C5").Текст);
		стрСтоимостьДляКлиента= СокрЛП(ТабличныйДокумент.Область("R"+стрНомерСтроки+"C6").Текст);
		стрМинимальнаяСтоимость= СокрЛП(ТабличныйДокумент.Область("R"+стрНомерСтроки+"C7").Текст);

		//Получаем значения
		ЗонаДоставки= Обработки.КартографическийИнтерфейсДоставка.ПолучитьЗонуДоставкиПоНаименованию(стрЗонаДоставки);
		ТабличныйДокумент.Область("R"+стрНомерСтроки+"C1").ЦветФона= ЦветБелый;
		Если Не ЗначениеЗаполнено(ЗонаДоставки) Тогда
			Ошибка= Истина;
			ТабличныйДокумент.Область("R"+стрНомерСтроки+"C1").ЦветФона= ЦветОшибка;
		КонецЕсли;
		
		Тариф= Справочники.ТарифыПеревозчиков.НайтиПоНаименованию(стрТариф, Истина); 
		ТабличныйДокумент.Область("R"+стрНомерСтроки+"C2").ЦветФона= ЦветБелый;
		Если Не ЗначениеЗаполнено(Тариф) Тогда
			Ошибка= Истина;
			ТабличныйДокумент.Область("R"+стрНомерСтроки+"C2").ЦветФона= ЦветОшибка;
		КонецЕсли;
		
		Филиал= Справочники.СтруктураПредприятия.НайтиПоНаименованию(стрФилиал, Истина);
		ТабличныйДокумент.Область("R"+стрНомерСтроки+"C3").ЦветФона= ЦветБелый;
		Если Не ЗначениеЗаполнено(Филиал) Тогда
			Ошибка= Истина;
			ТабличныйДокумент.Область("R"+стрНомерСтроки+"C3").ЦветФона= ЦветОшибка;
		КонецЕсли;
		
		Попытка
			Период= Дата(СтрШаблон("%1 %2",стрПериод,"00:00:00")); 
			ТабличныйДокумент.Область("R"+стрНомерСтроки+"C4").ЦветФона= ЦветБелый;
		Исключение
			Ошибка= Истина;
			ТабличныйДокумент.Область("R"+стрНомерСтроки+"C4").ЦветФона= ЦветОшибка;
		КонецПопытки;
		
		Попытка
			СтоимостьДляВодителя= Число(стрСтоимостьДляВодителя);
			ТабличныйДокумент.Область("R"+стрНомерСтроки+"C5").ЦветФона= ЦветБелый;
		Исключение
			Ошибка= Истина;
			ТабличныйДокумент.Область("R"+стрНомерСтроки+"C5").ЦветФона= ЦветОшибка;
		КонецПопытки;
		
		Попытка
			СтоимостьДляКлиента= Число(стрСтоимостьДляКлиента); 
			ТабличныйДокумент.Область("R"+стрНомерСтроки+"C6").ЦветФона= ЦветБелый;
		Исключение
			Ошибка= Истина;
			ТабличныйДокумент.Область("R"+стрНомерСтроки+"C6").ЦветФона= ЦветОшибка;
		КонецПопытки;
		
		Попытка
			МинимальнаяСтоимость= Число(стрМинимальнаяСтоимость);
			ТабличныйДокумент.Область("R"+стрНомерСтроки+"C7").ЦветФона= ЦветБелый;
		Исключение
			Ошибка= Истина;
			ТабличныйДокумент.Область("R"+стрНомерСтроки+"C7").ЦветФона= ЦветОшибка;
		КонецПопытки;
				
		//Пишем данные
		Если Не Ошибка Тогда
			НаборЗаписей= РегистрыСведений.СтоимостьДоставкиПоЗонам.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ЗонаДоставки.Установить(ЗонаДоставки);
			НаборЗаписей.Отбор.Тариф.Установить(Тариф);
			НаборЗаписей.Отбор.Филиал.Установить(Филиал);  
			НаборЗаписей.Отбор.Период.Установить(Период);
			
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() = 0 Тогда
				НоваяЗапись= НаборЗаписей.Добавить();
			Иначе
				НоваяЗапись= НаборЗаписей[0];
			КонецЕсли;
			
			НоваяЗапись.ЗонаДоставки= ЗонаДоставки;
			НоваяЗапись.Тариф= Тариф;
			НоваяЗапись.Филиал= Филиал; 
			НоваяЗапись.Период= Период;
			НоваяЗапись.СтоимостьДляВодителя= СтоимостьДляВодителя;
			НоваяЗапись.СтоимостьДляКлиента= СтоимостьДляКлиента;
			НоваяЗапись.МинимальнаяСтоимость= МинимальнаяСтоимость;			
			
			НаборЗаписей.Записать();
		КонецЕсли;
		
		НомерСтроки= НомерСтроки+1;
	КонецЦикла;
КонецПроцедуры
